/* No comment provided by engineer. */
"'(?R' or '(?DIGITS' must be followed by ')'." = "'(?R' or '(?DIGITS' must be followed by ')'.";

/* No comment provided by engineer. */
"'\\c' at end of pattern." = "'\\c' at end of pattern.";

/* No comment provided by engineer. */
"Assertion expected after '(?('." = "Assertion expected after '(?('.";

/* No comment provided by engineer. */
"Inconsistent newline compile option." = "Inconsistent newline compile option.";

/* No comment provided by engineer. */
"Internal error, code overflow." = "Internal error, code overflow.";

/* No comment provided by engineer. */
"Internal error, overran compiling workspace." = "Internal error, overran compiling workspace.";

/* No comment provided by engineer. */
"Internal error, previously-checked referenced subpattern was not found." = "Internal error, previously-checked referenced subpattern was not found.";

/* No comment provided by engineer. */
"Internal error, the error offset argument to pcre_exec() may not be NULL." = "Internal error, the error offset argument to pcre_exec() may not be NULL.";

/* No comment provided by engineer. */
"Internal error, unexpected repeat." = "Internal error, unexpected repeat.";

/* No comment provided by engineer. */
"Invalid character range specified inside the '[a-z]' character class." = "Invalid character range specified inside the '[a-z]' character class.";

/* No comment provided by engineer. */
"Invalid condition '(?(0)'." = "Invalid condition '(?(0)'.";

/* No comment provided by engineer. */
"Invalid escape sequence inside the '[...]' character class." = "Invalid escape sequence inside the '[...]' character class.";

/* No comment provided by engineer. */
"Invalid UTF8 string." = "Invalid UTF8 string.";

/* No comment provided by engineer. */
"Lookbehind assertion is not fixed length." = "Lookbehind assertion is not fixed length.";

/* No comment provided by engineer. */
"Malformed '\\P' or '\\p' escape sequence." = "Malformed '\\P' or '\\p' escape sequence.";

/* No comment provided by engineer. */
"Malformed number or name after '(?('." = "Malformed number or name after '(?('.";

/* No comment provided by engineer. */
"Memory allocation failure." = "Memory allocation failure.";

/* No comment provided by engineer. */
"Missing ')' after comment." = "Missing ')' after comment.";

/* No comment provided by engineer. */
"No error." = "No error.";

/* No comment provided by engineer. */
"Nothing to repeat." = "Nothing to repeat.";

/* No comment provided by engineer. */
"Number too big in {} quantifier." = "Number too big in {} quantifier.";

/* No comment provided by engineer. */
"Octal values greater than '\\377' are not permited when the UTF8 compile option is not set." = "Octal values greater than '\\377' are not permited when the UTF8 compile option is not set.";

/* No comment provided by engineer. */
"PCRE does not support '\\L', '\\l', '\\N', '\\U', or '\\u'." = "PCRE does not support '\\L', '\\l', '\\N', '\\U', or '\\u'.";

/* No comment provided by engineer. */
"POSIX collating elements are not supported." = "POSIX collating elements are not supported.";

/* No comment provided by engineer. */
"POSIX named classes are supported only within a '[...]' character class." = "POSIX named classes are supported only within a '[...]' character class.";

/* No comment provided by engineer. */
"Reference to non-existent subpattern." = "Reference to non-existent subpattern.";

/* No comment provided by engineer. */
"Repeating a DEFINE group is not allowed." = "Repeating a DEFINE group is not allowed.";

/* No comment provided by engineer. */
"Syntax error in subpattern name (missing terminator)." = "Syntax error in subpattern name (missing terminator).";

/* No comment provided by engineer. */
"The '\\g' escape sequence must be followed by a non-zero number, or a braced name or number, e.g. '{name}' or '{0123}'." = "The '\\g' escape sequence must be followed by a non-zero number, or a braced name or number, e.g. '{name}' or '{0123}'.";

/* No comment provided by engineer. */
"The character value in '\\x{...}' sequence is too large." = "The character value in '\\x{...}' sequence is too large.";

/* No comment provided by engineer. */
"The closing ')' for '(?C' is missing." = "The closing ')' for '(?C' is missing.";

/* No comment provided by engineer. */
"The closing ')' for a '(...)' parenthesis pair is missing." = "The closing ')' for a '(...)' parenthesis pair is missing.";

/* No comment provided by engineer. */
"The conditional group contains more than two branches." = "The conditional group contains more than two branches.";

/* No comment provided by engineer. */
"The DEFINE group contains more than one branch." = "The DEFINE group contains more than one branch.";

/* No comment provided by engineer. */
"The escape sequence '\\C' is not permittedd in a look-behind assertion." = "The escape sequence '\\C' is not permittedd in a look-behind assertion.";

/* No comment provided by engineer. */
"The escape sequences '\\P', '\\p', and '\\X' are not valid because the PCRE library was not built with Unicode support." = "The escape sequences '\\P', '\\p', and '\\X' are not valid because the PCRE library was not built with Unicode support.";

/* No comment provided by engineer. */
"The name of a named subpattern must be unique when the duplicate names compile option is not set." = "The name of a named subpattern must be unique when the duplicate names compile option is not set.";

/* No comment provided by engineer. */
"The named subpattern exceeds the maximum length of 32 characters." = "The named subpattern exceeds the maximum length of 32 characters.";

/* No comment provided by engineer. */
"The number after '(?C' is greater than 255." = "The number after '(?C' is greater than 255.";

/* No comment provided by engineer. */
"The number of named subpatterns exceeds the maximum of 10,000." = "The number of named subpatterns exceeds the maximum of 10,000.";

/* No comment provided by engineer. */
"The numbers are out of order in the '{x, y}' quantifier." = "The numbers are out of order in the '{x, y}' quantifier.";

/* No comment provided by engineer. */
"The PCRE library was not built with UTF8 support." = "The PCRE library was not built with UTF8 support.";

/* No comment provided by engineer. */
"The recursive call could loop indefinitely." = "The recursive call could loop indefinitely.";

/* No comment provided by engineer. */
"The regular expression is too large." = "The regular expression is too large.";

/* No comment provided by engineer. */
"The relative subpattern reference parameter to '(?+' , '(?-' , '(?(+', or '(?(-' must be followed by a non-zero number." = "The relative subpattern reference parameter to '(?+' , '(?-' , '(?(+', or '(?(-' must be followed by a non-zero number.";

/* No comment provided by engineer. */
"The repeated subpattern is too long." = "The repeated subpattern is too long.";

/* No comment provided by engineer. */
"The start of an escape sequence, '\\', was found at end of the regular expression." = "The start of an escape sequence, '\\', was found at end of the regular expression.";

/* No comment provided by engineer. */
"The terminating ']' for the '[...]' character class is missing." = "The terminating ']' for the '[...]' character class is missing.";

/* No comment provided by engineer. */
"Unknown error.  Code #%d." = "Unknown error.  Code #%d.";

/* No comment provided by engineer. */
"Unknown escape sequence specified by the character following '\\'." = "Unknown escape sequence specified by the character following '\\'.";

/* No comment provided by engineer. */
"Unknown POSIX class name." = "Unknown POSIX class name.";

/* No comment provided by engineer. */
"Unknown property name after '\\P' or '\\p'." = "Unknown property name after '\\P' or '\\p'.";

/* No comment provided by engineer. */
"Unmatched parentheses." = "Unmatched parentheses.";

/* No comment provided by engineer. */
"Unrecognized character after '(?'." = "Unrecognized character after '(?'.";

/* No comment provided by engineer. */
"Unrecognized character after '(?<'." = "Unrecognized character after '(?<'.";

/* No comment provided by engineer. */
"Unrecognized character after '(?P'." = "Unrecognized character after '(?P'.";

/* No comment provided by engineer. */
"Unrecognized compile option bit(s) set." = "Unrecognized compile option bit(s) set.";

